{
    "nonlove": "Nonlove refers simply to the absence of all three components of love. Sorry, there's no love between you and him/her.",
    "friendship": "This type of love is when the intimacy or liking component is present, but feelings of passion or commitment in the romantic sense are missing. Friendship love can be the root of other forms of love.",
    "infatuation": "Infatuation is characterized by feelings of lust and physical passion without liking and commitment. There has not been enough time for a deeper sense of intimacy, romantic love, or consummate love to develop. These may eventually arise after the infatuation phase. The initial infatuation is often very powerful.",
    "emptyLove": "Empty love is characterized by commitment without passion or intimacy. At times, a strong love deteriorates into empty love. The reverse may occur as well. For instance, an arranged marriage may start out empty but flourish into another form of love over time.",
    "romanticLove": "Romantic love bonds people emotionally through intimacy and physical passion. Partners in this type of relationship have deep conversations that help them know intimate details about each other. They enjoy sexual passion and affection. These couples may be at the point where long-term commitment or future plans are still undecided.",
    "companionateLove": "Companionate love is an intimate, but non-passionate sort of love. It includes the intimacy or liking component and the commitment component of the triangle. It is stronger than friendship, because there is a long-term commitment, but there is minimal or no sexual desire.\\This type of love is often found in marriages where the passion has died, but the couple continues to have deep affection or a strong bond together. This may also be viewed as the love between very close friends and family members.",
    "fatuousLove": "In this type of love, commitment and passion are present while intimacy or liking is absent. Fatuous love is typified by a whirlwind courtship in which passion motivates a commitment without the stabilizing influence of intimacy. Often, witnessing this leaves others confused about how the couple could be so impulsive. Unfortunately, such marriages often don't work out. When they do, many chalk the success up to luck.",
    "consummateLove": "Consummate love is made up of all three components and is the total form of love. It represents an ideal relationship. Couples who experience this kind of love have great sex several years into their relationship. They cannot imagine themselves with anyone else. They also cannot see themselves truly happy without their partners. They manage to overcome differences and face stressors together."
}