{
    "intimacy": {
        "definition": "Intimacy refers to feelings of closeness, connectedness, and bondedness in loving relationships. It thus includes within its purview those feelings that give rise, essentially, to the experience of warmth in a loving relationship.",
        "items": [
            "I feel close to him/her.",
            "I am willing to share myself and my possesions with him/her.",
            "I feel that I really understand him/her.",
            "I receive considerable emotional support from him/her.",
            "I give considerable emotional support to him/her."
        ]
    },
    "passion": {
        "definition": "Passion refers to the drives that lead to romance, physical attraction, sexual consummation, and related phenomena in loving relationships. The passion component includes within its purview those sources of motivational and other forms of arousal that lead to the experience of passion in a loving relationship.",
        "items": [
            "Just seeing him/her excites me.",
            "I find him/her to be very personally attractive.",
            "I especially like physical contact with him/her.",
            "When I see romantic movies and read romantic books, I think of him/her.",
            "I would rather be with him/her than with anyone else."
        ]
    },
    "commitment": {
        "definition": "Commitment refers, in the short-term, to the decision that one loves a certain other, and in the long-term, to one's commitment to maintain  that love. These two aspects of the decision/commitment component do not necessarily go together, in that one can decide to love someone without being committed to the love in the long-term, or one can be committed to a relationship without acknowledging that one loves the other person in the relationship.",
        "items": [
            "I have confidence in the stability of my relationship with him/her.",
            "I feel a sense of responsibility toward him/her.",
            "I am certain of my love for him/her.",
            "I view my relationship with him/her as a good decision.",
            "I view my commitment to him/her as a solid one."
        ]
    }
}